In [1]:
import pandas as pd
import numpy as np

In [4]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
data=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
data.shape

(5,)

In [7]:
data.values

array([1, 2, 3, 4, 5])

In [8]:
data.names="numbers"
data.size

5

In [10]:
data["a"],data["b"]

(np.int64(1), np.int64(2))

In [11]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [13]:
data.loc["a"],data.iloc[3]

(np.int64(1), np.int64(4))

In [14]:
data.loc[["a","c","e"]],data.iloc[3]

(a    1
 c    3
 e    5
 dtype: int64,
 np.int64(4))

In [19]:
dictionary={
    "usn":[1,2,3,4],
    "name":["alex","jack","ron","rolex"],
    "age":["12","15","34","27"],
    "branch":["cs","ec","me","cv"]
}

In [20]:
df=pd.DataFrame(dictionary)
df

   usn   name age branch
0    1   alex  12     cs
1    2   jack  15     ec
2    3    ron  34     me
3    4  rolex  27     cv

In [13]:
import pandas as pd
data=pd.read_csv(r"D:\sample.csv")
data

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3
9,9,110,Arjun,IT,27,54000,4,2020-08-19,Bangalore,4.0
10,10,111,Ravi,HR,33,47000,6,2017-05-23,Mumbai,3.6
11,11,112,Priya,Finance,31,59000,5,2019-09-17,Delhi,4.4
12,12,113,Kunal,IT,45,90000,18,2008-03-11,Bangalore,4.9
13,13,114,Sneha,HR,29,51000,3,2021-07-29,Mumbai,3.5
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [14]:
data.describe

<bound method NDFrame.describe of     Unnamed: 0  EmpID   Name Department  Age  Salary  Experience JoiningDate  \
0            0    101    Ram         IT   25   50000           2  2021-01-15
1            1    102  Shyam         HR   30   45000           5  2019-03-10
2            2    103  Geeta    Finance   28   60000           4  2020-07-22
3            3    104  Anita         IT   35   75000          10  2015-09-30
4            4    105  Kiran         HR   32   52000           7  2018-06-12
5            5    106   John    Finance   29   58000           3  2021-11-05
6            6    107  Meena         IT   41   82000          15  2010-04-18
7            7    108  David         HR   26   48000           2  2022-02-14
8            8    109   Sara    Finance   38   61000          12  2013-12-01
9            9    110  Arjun         IT   27   54000           4  2020-08-19
10          10    111   Ravi         HR   33   47000           6  2017-05-23
11          11    112  Priya    Finance   31   59000           5  2019-09-17
12          12    113  Kunal         IT   45   90000          18  2008-03-11
13          13    114  Sneha         HR   29   51000           3  2021-07-29
14          14    115  Vijay    Finance   36   62000          11  2014-01-10
15          15    116   Neha         IT   40   88000          14  2011-10-21
16          16    117   Amit         HR   34   53000           8  2016-04-05
17          17    118  Pooja    Finance   30   57000           6  2018-12-12
18          18    119  Rahul         IT   28   56000           4  2020-02-28
19          19    120  Divya         HR   37   49500           9  2015-06-30

         City  PerformanceScore
0   Bangalore               4.5
1      Mumbai               3.8
2       Delhi               4.2
3   Bangalore               4.9
4      Mumbai               4.1
5       Delhi               3.9
6   Bangalore               4.8
7      Mumbai               3.7
8       Delhi               4.3
9   Bangalore               4.0
10     Mumbai               3.6
11      Delhi               4.4
12  Bangalore               4.9
13     Mumbai               3.5
14      Delhi               4.2
15  Bangalore               4.7
16     Mumbai               4.0
17      Delhi               4.1
18  Bangalore               3.9
19     Mumbai               4.3  >

In [15]:
data.info

<bound method DataFrame.info of     Unnamed: 0  EmpID   Name Department  Age  Salary  Experience JoiningDate  \
0            0    101    Ram         IT   25   50000           2  2021-01-15
1            1    102  Shyam         HR   30   45000           5  2019-03-10
2            2    103  Geeta    Finance   28   60000           4  2020-07-22
3            3    104  Anita         IT   35   75000          10  2015-09-30
4            4    105  Kiran         HR   32   52000           7  2018-06-12
5            5    106   John    Finance   29   58000           3  2021-11-05
6            6    107  Meena         IT   41   82000          15  2010-04-18
7            7    108  David         HR   26   48000           2  2022-02-14
8            8    109   Sara    Finance   38   61000          12  2013-12-01
9            9    110  Arjun         IT   27   54000           4  2020-08-19
10          10    111   Ravi         HR   33   47000           6  2017-05-23
11          11    112  Priya    Finance   31   59000           5  2019-09-17
12          12    113  Kunal         IT   45   90000          18  2008-03-11
13          13    114  Sneha         HR   29   51000           3  2021-07-29
14          14    115  Vijay    Finance   36   62000          11  2014-01-10
15          15    116   Neha         IT   40   88000          14  2011-10-21
16          16    117   Amit         HR   34   53000           8  2016-04-05
17          17    118  Pooja    Finance   30   57000           6  2018-12-12
18          18    119  Rahul         IT   28   56000           4  2020-02-28
19          19    120  Divya         HR   37   49500           9  2015-06-30

         City  PerformanceScore
0   Bangalore               4.5
1      Mumbai               3.8
2       Delhi               4.2
3   Bangalore               4.9
4      Mumbai               4.1
5       Delhi               3.9
6   Bangalore               4.8
7      Mumbai               3.7
8       Delhi               4.3
9   Bangalore               4.0
10     Mumbai               3.6
11      Delhi               4.4
12  Bangalore               4.9
13     Mumbai               3.5
14      Delhi               4.2
15  Bangalore               4.7
16     Mumbai               4.0
17      Delhi               4.1
18  Bangalore               3.9
19     Mumbai               4.3  >

In [15]:
import pandas as pd
data=pd.read_csv(r"D:\test2.csv")
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [18]:
data.isnull()

   Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False

In [21]:
data.loc[1:3,"Name":"Department"]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [22]:
data.iloc[1:3,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance

In [24]:
data.rename(columns={"Name":"N","Age":"A","Department":"D","Salary":"S"},inplace=True)

In [25]:
data

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [32]:
data.drop('Unnamed: 0',axis=1,inplace=True)

In [30]:
data

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [34]:
data["update_salary"]=data["S"]+5000
data

         N     A        D        S  update_salary
0    Alice  25.0       HR  50000.0        55000.0
1      Bob  30.0       IT  60000.0        65000.0
2  Charlie  35.0  Finance  70000.0        75000.0
3    David   NaN       IT  62000.0        67000.0
4      Eve  29.0       HR      NaN            NaN
5    Alice  25.0       HR  50000.0        55000.0

In [35]:
data["update_salary"]=data["S"].map(lambda x:x+1000)
data

         N     A        D        S  update_salary
0    Alice  25.0       HR  50000.0        51000.0
1      Bob  30.0       IT  60000.0        61000.0
2  Charlie  35.0  Finance  70000.0        71000.0
3    David   NaN       IT  62000.0        63000.0
4      Eve  29.0       HR      NaN            NaN
5    Alice  25.0       HR  50000.0        51000.0

In [36]:
data.A.astype

<bound method NDFrame.astype of 0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: A, dtype: float64>

In [39]:
data.dropna(inplace=True)

In [40]:
data.isnull().sum()

N                0
A                0
D                0
S                0
update_salary    0
dtype: int64

In [41]:
'data["A"]=data.A.astype("int")

'data[data["A"]25]

In [4]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [6]:
data.isnull().sum()

Unnamed: 0    0
Name          0
Age           1
Department    0
Salary        1
dtype: int64

In [7]:
data["Age"] = data["Age"].fillna(value = data["Age"].mean())

In [9]:
data["Age"].mean()

np.float64(28.8)

In [10]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [12]:
data["Salary"] = data["Salary"].fillna(value = data["Salary"].mean())

In [13]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [14]:
data["Department"].value_counts()

Department
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [16]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [18]:
data.Age.ffill()

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [19]:
data.Salary.ffill

<bound method NDFrame.ffill of 0    50000.0
1    60000.0
2    70000.0
3    62000.0
4        NaN
5    50000.0
Name: Salary, dtype: float64>

In [31]:
data["Salary"]=data["Salary"].bfill

In [23]:
data

,Unnamed: 0,Name,Age,Department,Salary
0,0,Alice,25.0,HR,<bound method NDFrame.ffill of 0 <bound met...
1,1,Bob,30.0,IT,<bound method NDFrame.ffill of 0 <bound met...
2,2,Charlie,35.0,Finance,<bound method NDFrame.ffill of 0 <bound met...
3,3,David,NaN,IT,<bound method NDFrame.ffill of 0 <bound met...
4,4,Eve,29.0,HR,<bound method NDFrame.ffill of 0 <bound met...
5,5,Alice,25.0,HR,<bound method NDFrame.ffill of 0 <bound met...

In [40]:
import pandas as pd
data=pd.read_csv(r"D:\test2.csv")
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [41]:
data["level"]=data.apply(lambda row:"high" if row["Salary"]>6000 else "low",axis=1)
data

   Unnamed: 0     Name   Age Department   Salary level
0           0    Alice  25.0         HR  50000.0  high
1           1      Bob  30.0         IT  60000.0  high
2           2  Charlie  35.0    Finance  70000.0  high
3           3    David   NaN         IT  62000.0  high
4           4      Eve  29.0         HR      NaN   low
5           5    Alice  25.0         HR  50000.0  high

In [42]:
data["update_Salary"]=data["Salary"].apply(lambda x:x+5000)
data

   Unnamed: 0     Name   Age Department   Salary level  update_Salary
0           0    Alice  25.0         HR  50000.0  high        55000.0
1           1      Bob  30.0         IT  60000.0  high        65000.0
2           2  Charlie  35.0    Finance  70000.0  high        75000.0
3           3    David   NaN         IT  62000.0  high        67000.0
4           4      Eve  29.0         HR      NaN   low            NaN
5           5    Alice  25.0         HR  50000.0  high        55000.0

In [43]:
data.groupby("Department")["Salary"].mean()

Department
Finance    70000.0
HR         50000.0
IT         61000.0
Name: Salary, dtype: float64

In [44]:
products = pd.Series([700, 150, 300], index=['laptop', 'mouse', 'keyboard'])
print("product prices:")
print(products)

laptop_price = products['laptop']
print("\nlaptop price:",laptop_price)

first_two_products = products[:2]
print("\nfirst two products:")
print

product prices:
laptop      700
mouse       150
keyboard    300
dtype: int64

laptop price: 700

first two products:

In [46]:
import pandas as pd
import numpy as np

grades = pd.Series([85, None, 92, 45, None, 78, 55])
print("original grades:")
print(grades)

print("\nmissing values:")
print(grades.isnull())

filled_grades = grades.fillna(0)
print("\nfilled grades:")
print(filled_grades)

filtered_grades = filled_grades[filled_grades > 60]
print("\nscores > 60:")
print(filtered_grades)

original grades:
0    85.0
1     NaN
2    92.0
3    45.0
4     NaN
5    78.0
6    55.0
dtype: float64

missing values:
0    False
1     True
2    False
3    False
4     True
5    False
6    False
dtype: bool

filled grades:
0    85.0
1     0.0
2    92.0
3    45.0
4     0.0
5    78.0
6    55.0
dtype: float64

scores > 60:
0    85.0
2    92.0
5    78.0
dtype: float64

In [5]:
import pandas as pd

usernames = pd.Series([' alice ',' bob ',' charlie_data ', 'daisy'])
print("original Usernames:",usernames )

cleaned_usernames = usernames.str.strip().str.lower()
print("\ncleaned_usernames:",cleaned_usernames)

has_a = cleaned_usernames.str.contains('a')
print("\n names containing 'a':",has_a)

original Usernames: 0            alice
1              bob
2     charlie_data
3             daisy
dtype: object

cleaned_usernames: 0           alice
1             bob
2    charlie_data
3           daisy
dtype: object

 names containing 'a': 0     True
1    False
2     True
3     True
dtype: bool